app/controllers/entries_controller.rb

  def index
    @entries = params[:tag].present? ? Entry.tagged_with(params[:tag]) : @entries = Entry.all
---
SELECT "entries".* FROM "entries"

  def show
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @entry = Entry.new(params[:entry])

    @entry.tag_list = params[:tags] if params[:tags].present?
    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("body", "created_at", "date", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "world"], ["created_at", Sun, 15 Jul 2012 18:38:28 UTC +00:00], ["date", Thu, 05 Jul 2012 18:38:00 UTC +00:00], ["title", "hello"], ["updated_at", Sun, 15 Jul 2012 18:38:28 UTC +00:00]]

  def update
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]